# Общая задача семинара.
# Создать калькулятор для работы с рациональными и комплексными числами,
# - организовать меню. Ввод пользователем двух чисел и операции
# - добавить систему логирования
# Этап 1.
# Допустимый формат чисел
# - рациональные вида 7/65, 45/98, 2/4 и т.п.
# - целые числа вида 1, 34 и т.п.
# Подсказка из математики: рациональное число это упорядоченная пара чисел - числитель и знаменатель
# Для тестирования работы https://ru.symbolab.com/solver/rational-expression-calculator
# Реализовать операции сложение/вычитание/умножение/деление
# Результат выводить в виде рационального числа, без приведения к float.
# Не использовать библиотеки типа Decimal
# Задача 1. Описание архитектуры калькулятора
# - Выделить значимые куски работы программы
# - Определить структуру данных, в которых удобно хранить числа
# - Сформировать структуру модулей
# - Для каждого модуля продумать "dataflow" как меняются данные, какие функции будут использованы
# - Сформировать интерфейсы взаимодействия функций
# Задача 2. Написание кода калькулятора
# 1) Напсать "ядро" вычислений
# 2) Написать интерфейс пользователя
# 3) Логгирование как дополнение.
# Этап 2.
# Допустимый формат чисел помимо этапа 1.
# - комплексные числа с рациональными коэфф. вида 7/65 + 45/98j, 2/4 - 1/3j.
# Используется только j и в конце выражения.
# Подсказка из математики: комплексное число это упорядоченная пара чисел - действительная
# и мнимая часть числа.
# Результат выводить в виде комплексного числа вида 7/65 + 45/98j, без приведения к float.
# Реализовать операции сложение/вычитание и умножение
# Усложнение: реализовать операцию деление
# https://ru.wikipedia.org/wiki/Комплексное_число

# 2. Model:
# Функция преобразования: Вход: str = "7/65", Выход: list = [7, 65]
# Функция вычисления общего знаменателя: Вход: 2 int, Выход: 2 int (общий знаменатель)
# Вычисление коэффициента для умножения 2 дробей
# Функция calculate (выполнения матем.действия): Вход: 2 list (рациональных числа), операция: str (+,-), Выход: список (результат)

# 3. View - модуль взаимодейчствия с пользователем
# Функция ввода данных - 2 шт (число +оператор)
# Функция печати рационального числа

# 4.  Controller - модуль. View и Model импортируется только в него
# 5.  Main - точка входа - вызов главной функции кода